PureEngineering/PUREmodules/nrf52/modules_libraries/DW1000.cpp
#include "DW1000Time.h"

#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_drv_twi.h"
#include "ble_nus.h"
#include "bsp.h"
#include "i2c_driver.h"
#include "ble_driver.h"
#include "math.h"

#include "DW1000Time.h"
#include "DW1000.h"
#include "nrf_drv_spi.h"
#include "nrf_delay.h"



DW1000Class DW1000;

// pins
unsigned int DW1000Class::_ss;
unsigned int DW1000Class::_rst;
unsigned int DW1000Class::_irq;
// IRQ callbacks
void (*DW1000Class::_handleSent)(void) = 0;
void (*DW1000Class::_handleError)(void) = 0;
void (*DW1000Class::_handleReceived)(void) = 0;
void (*DW1000Class::_handleReceiveFailed)(void) = 0;
void (*DW1000Class::_handleReceiveTimeout)(void) = 0;
void (*DW1000Class::_handleReceiveTimestampAvailable)(void) = 0;
// registers
uint8_t DW1000Class::_syscfg[LEN_SYS_CFG];
uint8_t DW1000Class::_sysctrl[LEN_SYS_CTRL];
uint8_t DW1000Class::_sysstatus[LEN_SYS_STATUS];
uint8_t DW1000Class::_txfctrl[LEN_TX_FCTRL];
uint8_t DW1000Class::_sysmask[LEN_SYS_MASK];
uint8_t DW1000Class::_chanctrl[LEN_CHAN_CTRL];
uint8_t DW1000Class::_networkAndAddress[LEN_PANADR];
// driver internal state
uint8_t DW1000Class::_extendedFrameLength = FRAME_LENGTH_NORMAL;
uint8_t DW1000Class::_pacSize = PAC_SIZE_8;
uint8_t DW1000Class::_pulseFrequency = TX_PULSE_FREQ_16MHZ;
uint8_t DW1000Class::_dataRate = TRX_RATE_6800KBPS;
uint8_t DW1000Class::_preambleLength = TX_PREAMBLE_LEN_128;
uint8_t DW1000Class::_preambleCode = PREAMBLE_CODE_16MHZ_4;
uint8_t DW1000Class::_channel = CHANNEL_5;
DW1000Time DW1000Class::_antennaDelay;
bool DW1000Class::_smartPower = false;
bool DW1000Class::_frameCheck = true;
bool DW1000Class::_permanentReceive = false;
int DW1000Class::_deviceMode = IDLE_MODE;
// modes of operation
const uint8_t DW1000Class::MODE_LONGDATA_RANGE_LOWPOWER[] = {TRX_RATE_110KBPS, TX_PULSE_FREQ_16MHZ, TX_PREAMBLE_LEN_2048};
const uint8_t DW1000Class::MODE_SHORTDATA_FAST_LOWPOWER[] = {TRX_RATE_6800KBPS, TX_PULSE_FREQ_16MHZ, TX_PREAMBLE_LEN_128};
const uint8_t DW1000Class::MODE_LONGDATA_FAST_LOWPOWER[] = {TRX_RATE_6800KBPS, TX_PULSE_FREQ_16MHZ, TX_PREAMBLE_LEN_1024};
const uint8_t DW1000Class::MODE_SHORTDATA_FAST_ACCURACY[] = {TRX_RATE_6800KBPS, TX_PULSE_FREQ_64MHZ, TX_PREAMBLE_LEN_128};
const uint8_t DW1000Class::MODE_LONGDATA_FAST_ACCURACY[] = {TRX_RATE_6800KBPS, TX_PULSE_FREQ_64MHZ, TX_PREAMBLE_LEN_1024};
const uint8_t  DW1000Class::MODE_LONGDATA_RANGE_ACCURACY[] = {TRX_RATE_110KBPS, TX_PULSE_FREQ_64MHZ, TX_PREAMBLE_LEN_2048};
// SPI settings
//const SPISettings DW1000Class::_fastSPI = SPISettings(16000000L, MSBFIRST, SPI_MODE0);
//const SPISettings DW1000Class::_slowSPI = SPISettings(2000000L, MSBFIRST, SPI_MODE0);
//const SPISettings* DW1000Class::_currentSPI = &_fastSPI;

/* ###########################################################################
 * #### Init and end #######################################################
 * ######################################################################### */

//void DW1000Class::end(nrf_drv_spi_t spi) {
	//
//}
/*
void DW1000Class::select(int ss) {
	reselect(ss);
	// try locking clock at PLL speed (should be done already, 
	// but just to be sure)
	enableClock(AUTO_CLOCK);
	delay(5);
	// reset chip (either soft or hard)
	if(_rst > 0) {
		//TODO: Code for reset
	}
	reset();
	// default network and node id
	writeValueToBytes(_networkAndAddress, 0xFF, LEN_PANADR);
	writeNetworkIdAndDeviceAddress();
	// default system configuration
	memset(_syscfg, 0, LEN_SYS_CFG);
	setDoubleBuffering(false);
	setInterruptPolarity(true);
	writeSystemConfigurationRegister();
	// default interrupt mask, i.e. no interrupts
	clearInterrupts();
	writeSystemEventMaskRegister();
	// load LDE micro-code
	enableClock(XTI_CLOCK);
	delay(5);
	manageLDE();
	delay(5);
	enableClock(AUTO_CLOCK);
	delay(5);
}

void DW1000Class::reselect(int ss) {
	_ss = ss;
	pinMode(_ss, OUTPUT);
	digitalWrite(_ss, HIGH);
}*/
/*
void DW1000Class::begin(int irq) {
	//begin(irq, -1);
}

void DW1000Class::begin(int irq, int rst) {
	// generous initial init/wake-up-idle delay
	nrf_delay_ms(5);
	// start SPI
 	SPI.begin(); 
	SPI.usingInterrupt(irq);
	// pin and basic member setup
	_rst = rst;
	_irq = irq;
	_deviceMode = IDLE_MODE;
	// attach interrupt
	attachInterrupt(_irq, DW1000Class::handleInterrupt, RISING);
}*/

void DW1000Class::manageLDE() {
	// transfer any ldo tune values
	uint8_t  ldoTune[LEN_OTP_RDAT];
	readBytesOTP(0x04, ldoTune); // TODO #define
	if(ldoTune[0] != 0) {
		// TODO tuning available, copy over to RAM: use OTP_LDO bit
	}
	// tell the chip to load the LDE microcode
	// TODO remove clock-related code (PMSC_CTRL) as handled separately
	uint8_t  pmscctrl0[LEN_PMSC_CTRL0];
	uint8_t  otpctrl[LEN_OTP_CTRL];
	memset(pmscctrl0, 0, LEN_PMSC_CTRL0);
	memset(otpctrl, 0, LEN_OTP_CTRL);
	readBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	readBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
	pmscctrl0[0] = 0x01;
	pmscctrl0[1] = 0x03;
	otpctrl[0] = 0x00;
	otpctrl[1] = 0x80;
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	writeBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
	nrf_delay_ms(5);
	pmscctrl0[0] = 0x00;
	pmscctrl0[1] = 0x02;
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
}

void DW1000Class::enableClock(uint8_t  clock) {
	uint8_t  pmscctrl0[LEN_PMSC_CTRL0];
	memset(pmscctrl0, 0, LEN_PMSC_CTRL0);
	readBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	if(clock == AUTO_CLOCK) {
		//_currentSPI = &_fastSPI;
		pmscctrl0[0] = AUTO_CLOCK;
		pmscctrl0[1] &= 0xFE;
	} else if(clock == XTI_CLOCK) {
		//_currentSPI = &_slowSPI;
		pmscctrl0[0] &= 0xFC;
		pmscctrl0[0] |= XTI_CLOCK;
	} else if(clock == PLL_CLOCK) {
		//_currentSPI = &_fastSPI;
		pmscctrl0[0] &= 0xFC;
		pmscctrl0[0] |= PLL_CLOCK;
	} else {
		// TODO deliver proper warning
	}
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, 1);
    	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
}
/*
void DW1000Class::reset() {
	if(_rst < 0) {
		softReset();
	} else {
		digitalWrite(_rst, LOW);
		nrf_delay_ms(10);
		digitalWrite(_rst, HIGH);
		nrf_delay_ms(10);
		// force into idle mode (although it should be already after reset)
		idle();
	}
}*/

void DW1000Class::softReset() {
	uint8_t  pmscctrl0[LEN_PMSC_CTRL0];
	readBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	pmscctrl0[0] = 0x01;
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	pmscctrl0[3] = 0x00;
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	nrf_delay_ms(10);
	pmscctrl0[0] = 0x00;
	pmscctrl0[3] = 0xF0;
	writeBytes(nrf_drv_spi_t spi, PMSC, PMSC_CTRL0_SUB, pmscctrl0, LEN_PMSC_CTRL0);
	// force into idle mode
	idle();
}

void DW1000Class::enableMode(const uint8_t  mode[]) {
	setDataRate(mode[0]);
	setPulseFrequency(mode[1]);
	setPreambleLength(mode[2]);
	// TODO add channel and code to mode tuples 
	// TODO add channel and code settings with checks (see Table 58)
	setChannel(CHANNEL_5);
	if(mode[1] == TX_PULSE_FREQ_16MHZ) {
		setPreambleCode(PREAMBLE_CODE_16MHZ_4);
	} else {
		setPreambleCode(PREAMBLE_CODE_64MHZ_10);
	}
}

