PureEngineering/PUREmodules/nrf52/modules_libraries/DW1000.cpp
/*
 * Set the value of a bit in an array of bytes that are considered
 * consecutive and stored from MSB to LSB.
 * @param data
 * 		The number as byte array.
 * @param n
 * 		The number of bytes in the array.
 * @param bit
 * 		The position of the bit to be set.
 * @param val
 *		The bool value to be set to the given bit position.
 */
void DW1000Class::setBit(uint8_t data[], unsigned int n, unsigned int bit, bool val) {
	int idx;
	int shift;

	idx = bit / 8;
	if(idx >= n) {
		return; // TODO proper error handling: out of bounds
	}
	uint8_t* targetByte = &data[idx];
	shift = bit % 8;
	if(val) {
		bitSet(*targetByte, shift);
	} else {
		bitClear(*targetByte, shift);
	}
}

/*
 * Check the value of a bit in an array of bytes that are considered
 * consecutive and stored from MSB to LSB.
 * @param data
 * 		The number as byte array.
 * @param n
 * 		The number of bytes in the array.
 * @param bit
 * 		The position of the bit to be checked.
 */
bool DW1000Class::getBit(uint8_t data[], unsigned int n, unsigned int bit) {
	int idx;
	int shift;

	idx = bit / 8;
	if(idx >= n) {
		return false; // TODO proper error handling: out of bounds
	}
	uint8_t targetByte = data[idx];
	shift = bit % 8;
	
	return bitRead(targetByte, shift);
}

void DW1000Class::writeValueToBytes(uint8_t data[], long val, unsigned int n) {
	int i;	
	for(i = 0; i < n; i++) {
		data[i] = ((val >> (i * 8)) & 0xFF);
	}
}

/*
 * Read bytes from the DW1000. Number of bytes depend on register length.
 * @param cmd 
 * 		The register address (see Chapter 7 in the DW1000 user manual).
 * @param data 
 *		The data array to be read into.
 * @param n
 *		The number of bytes expected to be received.
 */
void DW1000Class::readBytes(nrf_drv_spi_t spi, uint8_t cmd, uint16_t offset, uint8_t data[], unsigned int n) {
	uint8_t header[3];
	int headerLen = 1;
	int i;
	if(offset == NO_SUB) {
		header[0] = READ | cmd;
	} else {
		header[0] = READ_SUB | cmd;
		if(offset < 128) {
			header[1] = (uint8_t)offset;
			headerLen++;
		} else {
			header[1] = READ | (uint8_t)offset;
			header[2] = (uint8_t)(offset >> 7);
			headerLen+=2;
		}
	}

	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, header, 3, data, n));

	while (!spi_xfer_done)
	{
		__WFE();
	}

	nrf_delay_ms(1);
}

// always 4 bytes
void DW1000Class::readBytesOTP(uint16_t address, uint8_t data[]) {
	uint8_t addressBytes[LEN_OTP_ADDR];
	uint8_t otpctrl[LEN_OTP_CTRL];
	readBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
	// bytes of address
	addressBytes[0] = (address & 0xFF);
	addressBytes[1] = ((address >> 8) & 0xFF);
    // set address
    writeBytes(nrf_drv_spi_t spi, OTP_IF, OTP_ADDR_SUB, addressBytes, LEN_OTP_ADDR);
	otpctrl[0] = 0x03;
	writeBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
	otpctrl[0] = 0x01;
	writeBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
	// read value
	readBytes(nrf_drv_spi_t spi, OTP_IF, OTP_RDAT_SUB, data, LEN_OTP_RDAT);
	otpctrl[0] = 0x00;
	writeBytes(nrf_drv_spi_t spi, OTP_IF, OTP_CTRL_SUB, otpctrl, LEN_OTP_CTRL);
}

/*
 * Write bytes to the DW1000. Single bytes can be written to registers via sub-addressing.
 * @param cmd 
 * 		The register address (see Chapter 7 in the DW1000 user manual).
 * @param offset
 *		The offset to select register sub-parts for writing, or 0x00 to disable 
 * 		sub-adressing.
 * @param data 
 *		The data array to be written.
 * @param n
 *		The number of bytes to be written (take care not to go out of bounds of 
 * 		the register).
 */
void DW1000Class::writeBytes(nrf_drv_spi_t spi, uint8_t cmd, uint16_t offset, uint8_t data[], unsigned int n) {
	uint8_t header[3];
	int headerLen = 1;
	int i;
	// TODO proper error handling: address out of bounds
	if(offset == NO_SUB) {
		header[0] = WRITE | cmd;
	} else {
		header[0] = WRITE_SUB | cmd;
		if(offset < 128) {
			header[1] = (uint8_t)offset;
			headerLen++;
		} else {
			header[1] = WRITE | (uint8_t)offset;
			header[2] = (uint8_t)(offset >> 7);
			headerLen+=2;
		}
	}
	int sendLen = n+3;
	uint8_t send_data[sendLen];
	send_data[0] = header[0];
	send_data[1] = header[1];
	send_data[2] = header[2];
	for(i = 0; i < n; i++) {
		send_data[3+i] = data[i];
	}
	uint8_t buffer[2];
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, send_data, sendLen, buffer, 2));

	while (!spi_xfer_done)
	{
		__WFE();
	}
}



void DW1000Class::getPrettyBytes(uint8_t data[], char msgBuffer[], unsigned int n) {
	unsigned int i, j, b;
	b = sprintf(msgBuffer, "Data, bytes: %d\nB: 7 6 5 4 3 2 1 0\n", n);
	for(i = 0; i < n; i++) {
		uint8_t curByte = data[i];
		snprintf(&msgBuffer[b++], 2, "%d", (i + 1));
		msgBuffer[b++] = (char)((i + 1) & 0xFF); msgBuffer[b++] = ':'; msgBuffer[b++] = ' ';
		for(j = 0; j < 8; j++) {
			msgBuffer[b++] = ((curByte >> (7 - j)) & 0x01) ? '1' : '0';
			if(j < 7) {
				msgBuffer[b++] = ' '; 
			} else if(i < n-1) {
				msgBuffer[b++] = '\n';
			} else {
				msgBuffer[b++] = '\0';
			}
		}
		
	}
	msgBuffer[b++] = '\0';
}

void DW1000Class::getPrettyBytes(uint8_t cmd, uint16_t offset, char msgBuffer[], unsigned int n) {
	unsigned int i, j, b;
	uint8_t* readBuf = (uint8_t*)malloc(n);
	readBytes(nrf_drv_spi_t spi, cmd, offset, readBuf, n);
	b = sprintf(msgBuffer, "Reg: 0x%02x, bytes: %d\nB: 7 6 5 4 3 2 1 0\n", cmd, n);
	for(i = 0; i < n; i++) {
		uint8_t curByte = readBuf[i];
		snprintf(&msgBuffer[b++], 2, "%d", (i + 1));
		msgBuffer[b++] = (char)((i + 1) & 0xFF); msgBuffer[b++] = ':'; msgBuffer[b++] = ' ';
		for(j = 0; j < 8; j++) {
			msgBuffer[b++] = ((curByte >> (7 - j)) & 0x01) ? '1' : '0';
			if(j < 7) {
				msgBuffer[b++] = ' '; 
			} else if(i < n-1) {
				msgBuffer[b++] = '\n';
			} else {
				msgBuffer[b++] = '\0';
			}
		}
		
	}
	msgBuffer[b++] = '\0';
	free(readBuf);
}
